; domain
; remove negative-precondition for powerlifted
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
    (:requirements :typing :strips)
    ; (:requirements :typing :strips :negative-preconditions)
    (:types
        car - object
        location - object
    )

    (:predicates
        (at-ferry ?l - location)
        (at ?c - car ?l - location)
        (empty-ferry)
        (on ?c - car)
    )

    (:action sail
        :parameters (?from - location ?to - location)
        :precondition (and
            (at-ferry ?from)
            ; (not (at-ferry ?to))
        )
        :effect (and (at-ferry ?to) (not (at-ferry ?from)))
    )

    (:action board
        :parameters (?car - car ?loc - location)
        :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
        :effect (and
            (on ?car)
            (not (at ?car ?loc))
            (not (empty-ferry)))
    )

    (:action debark
        :parameters (?car - car ?loc - location)
        :precondition (and (on ?car) (at-ferry ?loc))
        :effect (and
            (at ?car ?loc)
            (empty-ferry)
            (not (on ?car)))
    )
)

; problem
;; cars=6, locations=8, out_folder=training/easy, instance_id=38, seed=68

(define (problem ferry-38)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc8)
    (at car1 loc2)
    (at car2 loc4)
    (at car3 loc7)
    (at car4 loc8)
    (at car5 loc5)
    (at car6 loc6)
)
 (:goal  (and (at car1 loc5)
   (at car2 loc6)
   (at car3 loc3)
   (at car4 loc2)
   (at car5 loc6)
   (at car6 loc7))))

; plan
1. (board car4 loc8)
   deleted: (at car4 loc8) (empty-ferry)
   added: (on car4)
   goals met: 0 of 6
2. (sail loc8 loc2)
   deleted: (at-ferry loc8)
   added: (at-ferry loc2)
   goals met: 0 of 6
3. (debark car4 loc2)
   deleted: (on car4)
   added: (at car4 loc2) (empty-ferry)
   goals met: 1 of 6
4. (board car1 loc2)
   deleted: (at car1 loc2) (empty-ferry)
   added: (on car1)
   goals met: 1 of 6
5. (sail loc2 loc5)
   deleted: (at-ferry loc2)
   added: (at-ferry loc5)
   goals met: 1 of 6
6. (debark car1 loc5)
   deleted: (on car1)
   added: (at car1 loc5) (empty-ferry)
   goals met: 2 of 6
7. (board car5 loc5)
   deleted: (at car5 loc5) (empty-ferry)
   added: (on car5)
   goals met: 2 of 6
8. (sail loc5 loc6)
   deleted: (at-ferry loc5)
   added: (at-ferry loc6)
   goals met: 2 of 6
9. (debark car5 loc6)
   deleted: (on car5)
   added: (at car5 loc6) (empty-ferry)
   goals met: 3 of 6
10. (board car6 loc6)
   deleted: (at car6 loc6) (empty-ferry)
   added: (on car6)
   goals met: 3 of 6
11. (sail loc6 loc7)
   deleted: (at-ferry loc6)
   added: (at-ferry loc7)
   goals met: 3 of 6
12. (debark car6 loc7)
   deleted: (on car6)
   added: (at car6 loc7) (empty-ferry)
   goals met: 4 of 6
13. (board car3 loc7)
   deleted: (at car3 loc7) (empty-ferry)
   added: (on car3)
   goals met: 4 of 6
14. (sail loc7 loc3)
   deleted: (at-ferry loc7)
   added: (at-ferry loc3)
   goals met: 4 of 6
15. (debark car3 loc3)
   deleted: (on car3)
   added: (at car3 loc3) (empty-ferry)
   goals met: 5 of 6
16. (sail loc3 loc4)
   deleted: (at-ferry loc3)
   added: (at-ferry loc4)
   goals met: 5 of 6
17. (board car2 loc4)
   deleted: (at car2 loc4) (empty-ferry)
   added: (on car2)
   goals met: 5 of 6
18. (sail loc4 loc6)
   deleted: (at-ferry loc4)
   added: (at-ferry loc6)
   goals met: 5 of 6
19. (debark car2 loc6)
   deleted: (on car2)
   added: (at car2 loc6) (empty-ferry)
   goals met: 6 of 6
